Tekla Open API Reference for Tekla Structures 2025
GridCylindricalSurface Constructor (Arc, Double, String)
 Creates a new grid plane instance taking the plane and label as input.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GridCylindricalSurface(
	Arc cylinderBase,
	double cylinderHeight,
	string label
)
Public Sub New (
	cylinderBase As Arc,
	cylinderHeight As Double,
	label As String
)
Parameters
cylinderBase
Type: Tekla.Structures.Geometry3d.Arc
The base of the cylinder.
cylinderHeight
Type: System.Double
The height of the cylinder.
label
Type: System.String
The label for the grid plane.
See Also
Reference
GridCylindricalSurface Class
GridCylindricalSurface Overload
Tekla.Structures.Model Namespace